# data manipulation

In [1]:
import numpy as np
import pandas as pd

In [2]:
classes = ['A班', 'B班', 'C班', 'D班', 'E班']
student_ids = [12,132,321,54,78]
scores = [1,20,100,90,98]

# 创建 DataFrame
s = pd.DataFrame({'班别': classes, '学号': student_ids, '分数': scores})
s.index = ['张三', '李四', '王五', '赵六', '钱七']

In [3]:
s

    班别   学号   分数
张三  A班   12    1
李四  B班  132   20
王五  C班  321  100
赵六  D班   54   90
钱七  E班   78   98

In [5]:
s[s["分数"]>=90]

    班别   学号   分数
王五  C班  321  100
赵六  D班   54   90
钱七  E班   78   98